let dataTabs = [
    {
        cpu:"Mediatek Dimensity 8200 Ultra (4 نانومتری)",
        cpuHertz: "1 هسته 3.1 گیگاهرتز Cortex-A78 و 3 هسته 3.0 گیگاهرتز Cortex-A78 و 4 هسته 2.0 گیگاهرتز Cortex-A55",
        core:"هشت هسته",
        Gpu:"Mali-G610 MC6",
        sim:"دو سیم کارت نانو سیم (همزمان فعال)",
        Qcamera:"سه گانه 50 + 50 + 12 مگاپیکسل",
        os:"Android 13 با رابط کاربری MIUI 14، این نسخه برای زمانی است که این گوشی معرفی شده است و ممکن است در هنگام خرید شما، آپدیت جدیدتری برای آن آمده باشد و به اندروید ورژن بالاتر ارتقا پیدا کند.",
        weight:"162.2x75.7x8.5 میلی متر/ 193 گرم",
        body:"جلو شیشه، پشت شیشه یا پلیمر سیلیکون، فریم پلاستیک",
        hdd:"256 گیگابایت",
        ram:"12 گیگابایت",
        typeRam:"UFS 3.1",
        LED:'AMOLED',
        sizeLED:"6.67 اینچ",
        resColor:"68 میلیارد رنگ/ 1220x2712 پیکسل",
        resPerPixel:"446 پیکسل در هر اینچ",
        net:"5G",
        NFC:"دارد/ بستگی به کشور عرضه کننده",
    }
];
export const  dataProductTabs = ()=>{
    return dataTabs;
};