import xiaomi1 from '../assets/redmi not 13 4g.webp';
import xiaomi2 from '../assets/redmi a3.webp';

let samsungData = [
  {
    fullname: " سامسونگ گلکسی ",
    lastname: "A35  128/8GB ",
    photo: "https://avaneed.com/wp-content/uploads/2024/04/001-galaxy-a35-5g-awesomelilac-front.webp",
    des: "سری A سامسونگ برای افرادی است که نیاز به گوشی میانرده‌ای با قیمت مناسب دارند یکی از جدیدترین میانرده‌های سامسونگ Galaxy A55 است که برخی از مشخصات پرچمداران را نیز به ارث برده است. در صورتی که قصد خرید گوشی را دارید و تمایل دارید که درباره آن اطلاعات دقیق‌تری داشته باشید در ادامه همراه ما باشید.",
    price: "14,000,000",
    discount: true,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 1

  },
  {
    fullname: "موبایل سامسونگ ",
    lastname: "Z Fold6  256/12GB ",
    photo:
      "https://avaneed.com/wp-content/uploads/2024/07/galaxy-zfold6-silvershadow-openback115.webp",
    des: "درست است که در نگاه اول samsung galaxy s24 ultra تا حد زیادی شبیه به نسل قبلی به نظر می‌رسد اما این گوشی تغییراتی هم داشته که باعث می‌شود بیشتر از قبل شایسته نام پرچمدار باشد. کره‌ای‌ها ضخامت این مدل را ۰٫۳ میلی‌متر نسبت به قبل کاهش داده‌اند و حالا شاهد فریم تیتانیوم گرید ۲ به‌جای آلومینیوم هستیم، بهبودی که اپل در ایفون ۱۵ پرو مکس آن را وارد دنیای موبایل کرد.",
    price: "62,000,000",
    discount: false,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 2
  },
  {
    fullname: "موبایل سامسونگ",
    lastname: "Galaxy S24 Ultra  512/12GB",
    photo:
      "https://avaneed.com/wp-content/uploads/2024/01/037-galaxy-s24ultra-titaniumviolet-device-spen-front.webp",
    des: "درست است که در نگاه اول samsung galaxy s24 ultra تا حد زیادی شبیه به نسل قبلی به نظر می‌رسد اما این گوشی تغییراتی هم داشته که باعث می‌شود بیشتر از قبل شایسته نام پرچمدار باشد. کره‌ای‌ها ضخامت این مدل را ۰٫۳ میلی‌متر نسبت به قبل کاهش داده‌اند و حالا شاهد فریم تیتانیوم گرید ۲ به‌جای آلومینیوم هستیم، بهبودی که اپل در ایفون ۱۵ پرو مکس آن را وارد دنیای موبایل کرد.",
    price: "50,000,000",
    discount: true,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 3
  },
  {
    fullname: "گوشی موبایل سامسونگ ",
    lastname: "Galaxy S24 Ultra 256G",
    photo:
      "https://avaneed.com/wp-content/uploads/2024/07/galaxy-zfold6-silvershadow-openback115.webp",
    des: "درست است که در نگاه اول samsung galaxy s24 ultra تا حد زیادی شبیه به نسل قبلی به نظر می‌رسد اما این گوشی تغییراتی هم داشته که باعث می‌شود بیشتر از قبل شایسته نام پرچمدار باشد. کره‌ای‌ها ضخامت این مدل را ۰٫۳ میلی‌متر نسبت به قبل کاهش داده‌اند و حالا شاهد فریم تیتانیوم گرید ۲ به‌جای آلومینیوم هستیم، بهبودی که اپل در ایفون ۱۵ پرو مکس آن را وارد دنیای موبایل کرد.",
    price: "30,000,000",
    discount: false,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 4
  },
  {
    fullname: "گوشی موبایل سامسونگ ",
    lastname: "Galaxy S24",
    photo:
      "https://avaneed.com/wp-content/uploads/2023/10/SAMSUNG-A24-2.webp",
    des: "درست است که در نگاه اول samsung galaxy s24 ultra تا حد زیادی شبیه به نسل قبلی به نظر می‌رسد اما این گوشی تغییراتی هم داشته که باعث می‌شود بیشتر از قبل شایسته نام پرچمدار باشد. کره‌ای‌ها ضخامت این مدل را ۰٫۳ میلی‌متر نسبت به قبل کاهش داده‌اند و حالا شاهد فریم تیتانیوم گرید ۲ به‌جای آلومینیوم هستیم، بهبودی که اپل در ایفون ۱۵ پرو مکس آن را وارد دنیای موبایل کرد.",
    price: "10,000,000",
    discount: true,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 5
  },
  {
    fullname: "موبایل سامسونگ ",
    lastname: "S23 256/8GB ",
    photo:
      "https://avaneed.com/wp-content/uploads/2023/12/S23-8-256-2.webp",
    des: "درست است که در نگاه اول samsung galaxy s24 ultra تا حد زیادی شبیه به نسل قبلی به نظر می‌رسد اما این گوشی تغییراتی هم داشته که باعث می‌شود بیشتر از قبل شایسته نام پرچمدار باشد. کره‌ای‌ها ضخامت این مدل را ۰٫۳ میلی‌متر نسبت به قبل کاهش داده‌اند و حالا شاهد فریم تیتانیوم گرید ۲ به‌جای آلومینیوم هستیم، بهبودی که اپل در ایفون ۱۵ پرو مکس آن را وارد دنیای موبایل کرد.",
    price: "8,000,000",
    discount: false,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 6
  }
];


let xiaomiData = [
  {
    fullname: " گوشی موبایل شیائومی",
    lastname: "redmi A3 128G 4G/ram ",
    photo: xiaomi2,
    des: "سری A سامسونگ برای افرادی است که نیاز به گوشی میانرده‌ای با قیمت مناسب دارند یکی از جدیدترین میانرده‌های سامسونگ Galaxy A55 است که برخی از مشخصات پرچمداران را نیز به ارث برده است. در صورتی که قصد خرید گوشی را دارید و تمایل دارید که درباره آن اطلاعات دقیق‌تری داشته باشید در ادامه همراه ما باشید.",
    price: "14,000,000",
    discount: true,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 7
  },
  {
    fullname: "گوشی موبایل شیائومی",
    lastname: "Redmi Note 13 4G ram 8G ",
    photo: xiaomi1,
    des: "درست است که در نگاه اول  تا حد زیادی شبیه به نسل قبلی به نظر می‌رسد اما این گوشی تغییراتی هم داشته که باعث می‌شود بیشتر از قبل شایسته نام پرچمدار باشد. کره‌ای‌ها ضخامت این مدل را ۰٫۳ میلی‌متر نسبت به قبل کاهش داده‌اند و حالا شاهد فریم تیتانیوم گرید ۲ به‌جای آلومینیوم هستیم، بهبودی که اپل در ایفون ۱۵ پرو مکس آن را وارد دنیای موبایل کرد.",
    price: "62,000,000",
    discount: false,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 8
  },
  {
    fullname: "موبایل شیائومی ",
    lastname: "Redmi Note 13 Pro Plus 5G ",
    photo: "https://avaneed.com/wp-content/uploads/2024/02/xiaomi_redmi_note_13_pro_plus_black.webp",
    des: "سری پوکو شیائومی همواره جزو محصولات خوش قیمت این برند هستند که قابلیت‌های قدرتمندی را در کنار قیمتی اقتصادی ارائه می‌کند. پوکو C65 یکی از محصولات این برند است که طرفداران زیادی دارد و از امکانات مناسبی نیز برخوردار شده است. در ادامه به معرفی گوشی poco c65 خواهیم پرداخت.",
    price: "12,000,000",
    discount: false,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 9
  },
  {
    fullname: " موبایل شیائومی ",
    lastname: "Redmi Note 12 5G ",
    photo: "https://avaneed.com/wp-content/uploads/2024/06/NOTE-12-.webp",
    des: "سری پوکو شیائومی همواره جزو محصولات خوش قیمت این برند هستند که قابلیت‌های قدرتمندی را در کنار قیمتی اقتصادی ارائه می‌کند. پوکو C65 یکی از محصولات این برند است که طرفداران زیادی دارد و از امکانات مناسبی نیز برخوردار شده است. در ادامه به معرفی گوشی poco c65 خواهیم پرداخت.",
    price: "13,500,000",
    discount: true,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 10
  },
  {
    fullname: " موبایل شیائومی پوکو  گلوبال",
    lastname: "F6 Pro حافظه 256/12GB ",
    photo: "https://avaneed.com/wp-content/uploads/2024/06/POCO_F6_Pro_black.webp",
    des: "سری پوکو شیائومی همواره جزو محصولات خوش قیمت این برند هستند که قابلیت‌های قدرتمندی را در کنار قیمتی اقتصادی ارائه می‌کند. پوکو C65 یکی از محصولات این برند است که طرفداران زیادی دارد و از امکانات مناسبی نیز برخوردار شده است. در ادامه به معرفی گوشی poco c65 خواهیم پرداخت.",
    price: "10,000,000",
    discount: false,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 11,
  }
];

let product = [
  {
    keySearch: " سامسونگ گلکسی ",
  },
  {
    fullname: " سامسونگ گلکسی ",
    lastname: "A35  128/8GB سامسونگ گلکسی ",
    keySearch:'سامسونگ A35 ',
    photo: "https://avaneed.com/wp-content/uploads/2024/04/001-galaxy-a35-5g-awesomelilac-front.webp",
    des: "سری A سامسونگ برای افرادی است که نیاز به گوشی میانرده‌ای با قیمت مناسب دارند یکی از جدیدترین میانرده‌های سامسونگ Galaxy A55 است که برخی از مشخصات پرچمداران را نیز به ارث برده است. در صورتی که قصد خرید گوشی را دارید و تمایل دارید که درباره آن اطلاعات دقیق‌تری داشته باشید در ادامه همراه ما باشید.",
    price: "14,000,000",
    discount: true,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 1

  },
  {
    fullname: "موبایل سامسونگ ",
    lastname: "Z Fold6  256/12GB موبایل سامسونگ ",
    keySearch:'Z Fold6  سامسونگ',
    photo:
      "https://avaneed.com/wp-content/uploads/2024/07/galaxy-zfold6-silvershadow-openback115.webp",
    des: "درست است که در نگاه اول Z Fold6  256/12GB تا حد زیادی شبیه به نسل قبلی به نظر می‌رسد اما این گوشی تغییراتی هم داشته که باعث می‌شود بیشتر از قبل شایسته نام پرچمدار باشد. کره‌ای‌ها ضخامت این مدل را ۰٫۳ میلی‌متر نسبت به قبل کاهش داده‌اند و حالا شاهد فریم تیتانیوم گرید ۲ به‌جای آلومینیوم هستیم، بهبودی که اپل در ایفون ۱۵ پرو مکس آن را وارد دنیای موبایل کرد.",
    price: "62,000,000",
    discount: false,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 2
  },
  {
    fullname: "موبایل سامسونگ",
    lastname: "Galaxy S24 Ultra  512/12GB",
    keySearch:'موبایل سامسونگ Galaxy S24 Ultra ',
    photo:
      "https://avaneed.com/wp-content/uploads/2024/01/037-galaxy-s24ultra-titaniumviolet-device-spen-front.webp",
    des: "درست است که در نگاه اول samsung galaxy s24 ultra تا حد زیادی شبیه به نسل قبلی به نظر می‌رسد اما این گوشی تغییراتی هم داشته که باعث می‌شود بیشتر از قبل شایسته نام پرچمدار باشد. کره‌ای‌ها ضخامت این مدل را ۰٫۳ میلی‌متر نسبت به قبل کاهش داده‌اند و حالا شاهد فریم تیتانیوم گرید ۲ به‌جای آلومینیوم هستیم، بهبودی که اپل در ایفون ۱۵ پرو مکس آن را وارد دنیای موبایل کرد.",
    price: "50,000,000",
    discount: true,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 3
  },
  {
    fullname: "گوشی موبایل سامسونگ ",
    lastname: "Galaxy S24 Ultra 256G",
    keySearch:'گوشی موبایل سامسونگ  Galaxy S24 Ultra',
    photo:
      "https://avaneed.com/wp-content/uploads/2024/07/galaxy-zfold6-silvershadow-openback115.webp",
    des: "درست است که در نگاه اول samsung galaxy s24 ultra تا حد زیادی شبیه به نسل قبلی به نظر می‌رسد اما این گوشی تغییراتی هم داشته که باعث می‌شود بیشتر از قبل شایسته نام پرچمدار باشد. کره‌ای‌ها ضخامت این مدل را ۰٫۳ میلی‌متر نسبت به قبل کاهش داده‌اند و حالا شاهد فریم تیتانیوم گرید ۲ به‌جای آلومینیوم هستیم، بهبودی که اپل در ایفون ۱۵ پرو مکس آن را وارد دنیای موبایل کرد.",
    price: "30,000,000",
    discount: false,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 4
  },
  {
    fullname: "گوشی موبایل سامسونگ ",
    lastname: "Galaxy S24 ",
    keySearch:'سامسونگ Galaxy S24 ',
    photo:
      "https://avaneed.com/wp-content/uploads/2023/10/SAMSUNG-A24-2.webp",
    des: "درست است که در نگاه اول samsung galaxy s24  تا حد زیادی شبیه به نسل قبلی به نظر می‌رسد اما این گوشی تغییراتی هم داشته که باعث می‌شود بیشتر از قبل شایسته نام پرچمدار باشد. کره‌ای‌ها ضخامت این مدل را ۰٫۳ میلی‌متر نسبت به قبل کاهش داده‌اند و حالا شاهد فریم تیتانیوم گرید ۲ به‌جای آلومینیوم هستیم، بهبودی که اپل در ایفون ۱۵ پرو مکس آن را وارد دنیای موبایل کرد.",
    price: "10,000,000",
    discount: true,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 5
  },
  {
    fullname: "موبایل سامسونگ ",
    lastname: "S23  256/8GB ",
    keySearch:' سامسونگ Galaxy S23',
    photo:
      "https://avaneed.com/wp-content/uploads/2023/12/S23-8-256-2.webp",
    des: "درست است که در نگاه اول S23  256/8GB تا حد زیادی شبیه به نسل قبلی به نظر می‌رسد اما این گوشی تغییراتی هم داشته که باعث می‌شود بیشتر از قبل شایسته نام پرچمدار باشد. کره‌ای‌ها ضخامت این مدل را ۰٫۳ میلی‌متر نسبت به قبل کاهش داده‌اند و حالا شاهد فریم تیتانیوم گرید ۲ به‌جای آلومینیوم هستیم، بهبودی که اپل در ایفون ۱۵ پرو مکس آن را وارد دنیای موبایل کرد.",
    price: "8,000,000",
    discount: false,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 6
  },
  {
    fullname: " گوشی موبایل شیائومی",
    lastname: "redmi A3 128G 4G/ram ",
    keySearch:'گوشی موبایل شیائومی redmi A3 128G  ',
    photo: xiaomi2,
    des: "سری A سامسونگ برای افرادی است که نیاز به گوشی میانرده‌ای با قیمت مناسب دارند یکی از جدیدترین میانرده‌های سامسونگ Galaxy A55 است که برخی از مشخصات پرچمداران را نیز به ارث برده است. در صورتی که قصد خرید گوشی را دارید و تمایل دارید که درباره آن اطلاعات دقیق‌تری داشته باشید در ادامه همراه ما باشید.",
    price: "14,000,000",
    discount: true,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 7
  },
  {
    fullname: "گوشی موبایل شیائومی",
    lastname: "Redmi Note 13 4G ram 8G ",
    keySearch:'شیائومی redmi Note 13 4G ram 8G ',
    photo: xiaomi1,
    des: "درست است که در نگاه اول  تا حد زیادی شبیه به نسل قبلی به نظر می‌رسد اما این گوشی تغییراتی هم داشته که باعث می‌شود بیشتر از قبل شایسته نام پرچمدار باشد. کره‌ای‌ها ضخامت این مدل را ۰٫۳ میلی‌متر نسبت به قبل کاهش داده‌اند و حالا شاهد فریم تیتانیوم گرید ۲ به‌جای آلومینیوم هستیم، بهبودی که اپل در ایفون ۱۵ پرو مکس آن را وارد دنیای موبایل کرد.",
    price: "62,000,000",
    discount: false,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 8
  },
  {
    fullname: "موبایل شیائومی ",
    lastname: "Redmi Note 13 Pro Plus 5G ",
    keySearch:'موبایل شیائومی Redmi Note 13 Pro Plus 5G',
    photo: "https://avaneed.com/wp-content/uploads/2024/02/xiaomi_redmi_note_13_pro_plus_black.webp",
    des: "سری پوکو شیائومی همواره جزو محصولات خوش قیمت این برند هستند که قابلیت‌های قدرتمندی را در کنار قیمتی اقتصادی ارائه می‌کند. پوکو C65 یکی از محصولات این برند است که طرفداران زیادی دارد و از امکانات مناسبی نیز برخوردار شده است. در ادامه به معرفی گوشی poco c65 خواهیم پرداخت.",
    price: "12,000,000",
    discount: false,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 9
  },
  {
    fullname: " موبایل شیائومی ",
    lastname: "Redmi Note 12 5G ",
    keySearch:'موبایل شیائومی Redmi Note 12 5G  ',
    photo: "https://avaneed.com/wp-content/uploads/2024/06/NOTE-12-.webp",
    des: "سری پوکو شیائومی همواره جزو محصولات خوش قیمت این برند هستند که قابلیت‌های قدرتمندی را در کنار قیمتی اقتصادی ارائه می‌کند. پوکو C65 یکی از محصولات این برند است که طرفداران زیادی دارد و از امکانات مناسبی نیز برخوردار شده است. در ادامه به معرفی گوشی poco c65 خواهیم پرداخت.",
    price: "13,500,000",
    discount: true,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 10
  },
  {
    fullname: " موبایل شیائومی پوکو  گلوبال",
    lastname: "F6 Pro حافظه 256/12GB ",
    keySearch:'پوکو F6 Pro ',
    photo: "https://avaneed.com/wp-content/uploads/2024/06/POCO_F6_Pro_black.webp",
    des: "سری پوکو شیائومی همواره جزو محصولات خوش قیمت این برند هستند که قابلیت‌های قدرتمندی را در کنار قیمتی اقتصادی ارائه می‌کند. پوکو C65 یکی از محصولات این برند است که طرفداران زیادی دارد و از امکانات مناسبی نیز برخوردار شده است. در ادامه به معرفی گوشی poco c65 خواهیم پرداخت.",
    price: "10,000,000",
    discount: false,
    cpu: "Mediatek Helio G99 (6nm)",
    screen: "6.5 اینچ",
    hdd: "128 گیگابایت",
    ram: "4 گیگابایت",
    camera: "50 مگاپیکسل",
    battry: "5000 میلی‌آمپرساعت",
    id: 11,
  }
]


export const dataProductSamsung = () => {
  return samsungData;
}
export const dataProductXiaomi = () => {
  return xiaomiData;
};
export const dataProduct = () => {
  return product;
}


// export const getBook = num => {
//     return books.find(book => book.number === num);
// }